Pcase-origin/Case/case2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          29;
        startFace       871;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       900;
    }
    sWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3;
        startFace       940;
    }
    nWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6;
        startFace       943;
    }
    sideWalls
    {
        type            empty;
        inGroups        1(empty);
        nFaces          926;
        startFace       949;
    }
    glass1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9;
        startFace       1875;
    }
    glass2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2;
        startFace       1884;
    }
    sun
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14;
        startFace       1886;
    }
    heatsource1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3;
        startFace       1900;
    }
    heatsource2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4;
        startFace       1903;
    }
)

// ************************************************************************* //
